/* Bank name when bank is offline for maintenance. */
"%@ - Offline" = "%@ - offline";

/* {card brand} ending in {last4} */
"%@ Ending In %@" = "%1$@ végződése %2$@";

/* Source type brand name */
"3D Secure" = "3D Secure";

/* part of {Account} ending in {last4} */
"Account" = "számla";

/* Title for address entry section */
"ACCOUNT HOLDER ADDRESS" = "SZÁMLATULAJDONOS CÍME";

/* Caption for Name field on bank info form */
"Account Holder Name" = "Számlatulajdonos neve";

/* Placeholder text for Account number entry field for BECS Debit. */
"Account number" = "Számlaszám";

/* Title for Add a Card view */
"Add a Card" = "Kártya hozzáadása";

/* Title for SEPA Debit Account form */
"Add a Direct Debit Account" = "Új beszedési számla hozzáadása";

/* Button to add a new credit card. */
"Add New Card…" = "Új kártya hozzáadása...";

/* Caption for Address field on address form */
"Address" = "Cím";

/* Source type brand name */
"Alipay" = "Alipay";

/* Text for Apple Pay payment method */
"Apple Pay" = "Apple Pay";

/* Caption for Apartment/Address line 2 field on address form */
"Apt." = "Házszám";

/*  This is a Payment Method type brand name so shouldn't be translated unless it has a different name in a given localization. */
"AU BECS Debit" = "AU BECS-jóváírás";

/* Text for back button */
"Back" = "Vissza";

/* Source type brand name */
"Bancontact" = "Bancontact";

/* Title for bank picker section */
"BANK" = "BANK";

/* Label for Bank Account selection or detail entry form */
"Bank Account" = "Bankszámla";

/* Title for bank account information form */
"BANK ACCOUNT INFORMATION" = "BANKSZÁMLA-INFORMÁCIÓ";

/* Title for billing address entry section */
"BILLING ADDRESS" = "SZÁMLÁZÁSI CÍM";

/* Title for billing address entry section */
"Billing Address" = "Számlázási cím";

/* Placeholder text for BSB Number entry field for BECS Debit. */
"BSB" = "BSB";

/* SEPA legal authorization text – must use official translations. */
"By providing your IBAN and confirming this payment, you are authorizing %@ and Stripe, our payment service provider, to send instructions to your bank to debit your account and your bank to debit your account in accordance with those instructions. You are entitled to a refund from your bank under the terms and conditions of your agreement with your bank. A refund must be claimed within 8 weeks starting from the date on which your account was debited." = "IBAN-száma megadásával és a kifizetés megerősítésével engedélyezi, hogy a(z) %@ és a Stripe, a kifizetési szolgáltatónk utasításokat küldjön bankjának a számlája megterhelése céljából és a bankja megterhelje számláját az utasításoknak megfelelően. Ön visszatérítésre jogosult a bankjától a bankjával fennálló szerződésének feltételei és kikötései szerint. A visszatérítést a számla megterhelésének dátumától számított 8 héten belül igényelni kell.";

/* Title for card number entry field */
"CARD" = "KÁRTYA";

/* Title for credit card number entry field */
"Card" = "Kártya";

/* accessibility label for text field */
"card number" = "kártyaszám";

/* Caption for City field on address form */
"City" = "Város";

/* Title for contact info form */
"CONTACT" = "KAPCSOLAT";

/* Title for contact info form */
"Contact" = "Kapcsolat";

/* Text for continue button */
"Continue" = "Folytatás";

/* Caption for Country field on address form */
"Country" = "Ország";

/* Title for country picker section */
"COUNTRY" = "ORSZÁG";

/* Caption for County field on address form (only countries that use county, like United Kingdom) */
"County" = "Megye";

/* Label for entering CVC in text field */
"CVC" = "CVC";

/* Label for entering CVV in text field */
"CVV" = "CVV";

/* Title for delivery info form */
"Delivery" = "Szállítás";

/* Title for delivery address entry section */
"DELIVERY ADDRESS" = "SZÁLLÍTÁSI CÍM";

/* Title for delivery address entry section */
"Delivery Address" = "Szállítási cím";

/* Caption for Email field on address form */
"Email" = "E-mail";

/* Source type brand name */
"EPS" = "EPS";

/* Placeholder string for email entry field. */
"example@example.com" = "valaki@example.com";

/* accessibility label for text field */
"expiration date" = "lejárati dátum";

/* Payment Method type brand name */
"FPX" = "FPX";

/* Label for free shipping method */
"Free" = "Ingyenes";

/* Placeholder string for name entry field. */
"Full name" = "Teljes név";

/* Source type brand name */
"Giropay" = "Giropay";

/* Payment Method type brand name. */
"giropay" = "giropay";

/* IBAN placeholder – don't translate */
"IBAN" = "IBAN";

/* Source type brand name */
"iDEAL" = "iDEAL";

/* Spoken during VoiceOver when a form field has failed validation. */
"Invalid data." = "Érvénytelen adat.";

/* Shipping form error message */
"Invalid Shipping Address" = "Érvénytelen szállítási cím";

/* Source type brand name */
"Klarna" = "Klarna";

/* Title for screen when data is still loading from the network. */
"Loading…" = "Betöltés...";

/* label for text field to enter card expiry */
"MM/YY" = "HH/ÉÉ";

/* Title for payment options section */
"MORE OPTIONS" = "TOVÁBBI LEHETŐSÉGEK";

/* Source type brand name */
"Multibanco" = "Multibanco";

/* Caption for Name field on address form */
"Name" = "Név";

/* Label for button to add a new credit or debit card */
"New Card" = "Új kártya";

/* Label for button to add a new SEPA Direct Debit account */
"New Direct Debit Account" = "Új beszedési számla";

/* Accessibility label for button to add a new SEPA Direct Debit account */
"New SEPA Direct Debit Account" = "Új SEPA-beszedési számla";

/* Button to move to the next text entry field */
"Next" = "Tovább";

/* No comment provided by engineer. */
"OK" = "OK";

/* Button to pay with a Bank Account (using FPX). */
"Online Banking (FPX)" = "Online bankolás (FPX)";

/* Source type brand name */
"P24" = "P24";

/* Pay with {payment method} */
"Pay with %@" = "%@ fizetési mód";

/* Title for Payment Method screen */
"Payment Method" = "Fizetési mód";

/* Caption for Phone field on address form */
"Phone" = "Telefon";

/* Short string for postal code (text used in non-US countries). Please keep to 8 characters or less if possible. */
"Postal" = "ir.szám";

/* Caption for Postal Code field on address form (only shown in countries other than the United States) */
"Postal Code" = "Postai irányítószám";

/* Caption for Province field on address form (only countries that use province, like Canada) */
"Province" = "Tartomány";

/* Payment Method type brand name. */
"Przelewy24" = "Przelewy24";

/* Text for button to scan a credit card */
"Scan Card" = "Kártya beolvasása";

/* part of {SEPA Account} ending in {last4} */
"SEPA Account" = "SEPA-bankszámla";

/* Payment method brand name */
"SEPA Debit" = "SEPA beszedés";

/* Source type brand name */
"SEPA Direct Debit" = "SEPA-beszedés";

/* Title for shipping info form */
"Shipping" = "Szállítás";

/* Title for shipping address entry section */
"SHIPPING ADDRESS" = "SZÁLLÍTÁSI CÍM";

/* Title for shipping address entry section */
"Shipping Address" = "Szállítási cím";

/* Label for shipping method form */
"SHIPPING METHOD" = "SZÁLLÍTÁSI MÓD";

/* Label for shipping method form */
"Shipping Method" = "Szállítási mód";

/* Source type brand name */
"SOFORT" = "SOFORT";

/* Caption for State field on address form (only countries that use state , like United States) */
"State" = "Állam";

/* Caption for generalized state/province/region field on address form (not tied to a specific country's format) */
"State / Province / Region" = "Állam/tartomány/régió";

/* Error string displayed to user when they have entered an incomplete BSB number. BSB refers to an Australian bank account number */
"The BSB you entered is incomplete." = "A beírt BSB-szám hiányos.";

/* Error string displayed to user when they enter in an invalid BSB number. "BSB" refers to an Australian bank account. */
"The BSB you entered is invalid." = "A beírt BSB-szám érvénytelen.";

/* Error when the seleted payment method is not available (eg attempted to use 3D Secure on a card that does not support it). */
"The selected payment method is not available." = "A kiválasztott fizetési mód nem érhető el.";

/* Error when there is a problem processing the credit card */
"There was an error processing your card -- try again in a few seconds" = "Hiba történt kártyája feldolgozása során, próbálja újra néhány másodperc múlva";

/* Unexpected error, such as a 500 from Stripe or a JSON parse error */
"There was an unexpected error -- try again in a few seconds" = "Váratlan hiba lépett fel, próbálja újra néhány másodperc múlva";

/* Error when 3DS2 authentication timed out. */
"Timed out authenticating your payment method -- try again" = "Fizetési módjának hitelesítésénél időtúllépés történt, próbálja újra.";

/* Default missing source type label */
"Unknown" = "Ismeretlen";

/* Button to fill shipping address from billing address. */
"Use Billing" = "Számlázási használata";

/* Button to fill billing address from delivery address. */
"Use Delivery" = "Szállítási használata";

/* Button to fill billing address from shipping address. */
"Use Shipping" = "Szállítási használata";

/* Error when 3DS2 authentication failed (e.g. customer entered the wrong code) */
"We are unable to authenticate your payment method. Please choose a different payment method and try again." = "Nem tudjuk hitelesíteni a fizetési módját. Kérjük, válasszon másik fizetési módot, és próbálkozzon újból.";

/* Source type brand name */
"WeChat Pay" = "WeChat Pay";

/* You'll be taken to {bank name} to finish your purchase. */
"You'll be taken to %@ to finish your purchase." = "Tovább fog lépni %@ a vásárlás befejezéséhez.";

/* Error when the card has already expired */
"Your card has expired" = "A kártyája lejárt";

/* Error when the card was declined by the credit card networks */
"Your card was declined" = "A kártyáját elutasítottuk";

/* Error when the card's expiration month is not valid */
"Your card's expiration month is invalid" = "Kártyájának lejárati hónapja érvénytelen";

/* Error when the card's expiration year is not valid */
"Your card's expiration year is invalid" = "A kártyája lejárati éve érvénytelen";

/* Error when the card number is not valid */
"Your card's number is invalid" = "Kártyaszáma érvénytelen";

/* Error when the card's CVC is not valid */
"Your card's security code is invalid" = "Kártyájának biztonsági kódja érvénytelen";

/* Short string for zip code (United States only) Please keep to 5 characters or less if possible. */
"ZIP" = "Irányítószám";

/* Caption for Zip Code field on address form (only shown when country is United States only) */
"ZIP Code" = "Irányítószám";

